import * as fs from 'fs';
import { TemplateHandler } from 'easy-template-x';

// 1. read template file
const templateFile = fs.readFileSync('1.docx');

// 2. process the template
const data = {
  discipline: 'Основи інженерії програмного забезпечення',
  year: 2023,

  branch_number: 12,
  branch: 'Інформаційні технології',

  profession_number: 121,
  profession: 'Інженерія програмного забезпечення',

  professional_program: 'Інженерія програмного забезпечення',

  hours: [
    {
      form: 'Денна',
      course: '1',
      semester: '1',
      lectures: 30,
      laboratory: 30,
      irs: 4,
      training: 4,
      srs: 82,
      all: 150, // lectures + laboratory + irs + training + srs
      test: 1,
    },
    {
      form: 'Заочна',
      course: '1',
      semester: '1,2',
      lectures: 4,
      laboratory: 2,
      irs: '-',
      training: '-',
      srs: 144,
      all: 150, // lectures + laboratory + irs + training + srs
      test: 2,
    },
  ],

  program_protocol: 9,
  program_protocol_date: '26.05.2021',

  program_protocol_2: 1,
  program_protocol_date_2: '20.08.2021',

  program_protocol_3: 1,
  program_protocol_date_3: '20.08.2021',

  status: 'обов’язкова',
  language: 'українська',

  credits: 5,
  credit_modules: 3,
  content_modules: 3,

  weekly_hours: 10,
  classroom_hours: 4,

  goal: 'Метою вивчення дисципліни «Основи інженерії програмного забезпечення» є ознайомлення студентів з основними поняттями, методами та засобами програмної інженерії, а також формування у студентів знань основних принципів розробки ефективного програмного забезпечення та набуття ними навичок використання основних принципів реалізації етапів життєвого циклу ПЗ',
  task: 'Завданням вивчення дисципліни є глибоке та ґрунтовне засвоєння студентами основ програмної інженерії. У курсі подано виклад ключових понять, методів і засобів програмної інженерії як діяльності, націленої на створення програмних систем, що відповідають потребам замовників, з дотриманням планових термінів і бюджету. Розглянуті теми, актуальні для фахівців на шляху від формулювання замовником вимог до створення працездатного і якісного програмного продукту. Розглянуті питання програмної інженерії як інженерної дисципліни (застосування інженерами не тільки теоретичних методів і засобів розробки ПЗ, але і стандартів, правил і методик управління розробкою ПЗ), а також питання проведення інженерних оцінок якості, витрачених ресурсів, трудовитрат, вартості і ін., основні процеси при створенні програмного забезпечення, серед яких такі ключові розділи планування (це аналіз цілей і завдань, принципів реалізації і управління планами і ресурсами), супровід (усунення знайдених недоліків в ПЗ і внесення змін як еволюційний розвиток ПЗ ).',
  competencies: [
    {
      title:
        'здатність накопичувати, обробляти та систематизувати професійні знання щодо створення і супроводження програмного забезпечення та визнання важливості навчання протягом всього життя.',
    },
  ],

  prerequisites:
    'Вивчення курсу «Основи інженерії програмного забезпечення» не передбачає наявність глибоких знань спеціальних дисциплін, достатньо мати початкові уявлення про основні математичні поняття, основи алгоритмізації і методи програмування.',
  result: [
    {
      title:
        'знати основні процеси, фази та ітерації життєвого циклу програмного забезпечення.',
    },
    {
      title:
        'знати і застосовувати професійні стандарти і інші нормативно-правові документи в галузі інженерії програмного забезпечення.',
    },
  ],

  modules: [
    {
      number: 1,
      title: 'Інженерні основи програмного забезпечення',
      topics: [
        {
          number: 1,
          title: 'Вступ',
          text: 'Особливості індустрії ІТ в Україні та роль в ній програмної інженерії. Світові тенденції розвитку ПІ. Мета, завдання та предмет програмної інженерії. Структура курсу. Характеристика змістовних та залікових модулів.',
          literature: '2',
          lectures: 2,
          practic: 2,
          independent: 6,
          individual: 0,
          control: '',
        },
        {
          number: 2,
          title: 'Основи комп’ютингу',
          text: 'Основні поняття інформатики. Основи кодування інформації. Вимірювання інформації. Системи числення. Основи архітектури та функціонування ПК.',
          literature: '1, 8, 10',
          lectures: 2,
          practic: 2,
          independent: 6,
          individual: 0,
          control: 'Поточне опитування – 30 хв',
        },
        {
          number: 2,
          title: 'Базові поняття програмної інженерії',
          text: 'Поняття програмного забезпечення. Роль комп’ютерних наук у програмній інженерії. Структура витрат на створення ПЗ. Основні проблеми, які розв’язують фахівці по ПЗ. Професійні та етичні вимоги до фахівців по ПЗ.',
          literature: '1, 2',
          lectures: 2,
          practic: 2,
          independent: 6,
          individual: 0,
          control: '',
        },
      ],
    },
    {
      number: 2,
      title: 'Основи моделювання',
      topics: [
        {
          number: 4,
          title: 'Основи моделювання',
          text: 'Поняття моделі. Властивості та типи моделей. Основні етапи та типи моделювання.',
          literature: '4, 6',
          lectures: 2,
          practic: 2,
          independent: 4,
          individual: 0,
          control: 'Поточне опитування – 30 хв',
        },
      ],
    },
  ],

  subjects_of_laboratory: [
    {
      number: 1,
      topic:
        'Ознайомлення з сучасними середовищами розробки програмного забезпечення (6/1 год.)',
      goal: 'Дослідження можливостей сучасних засобів розробки ПЗ.',
      literature: '8',
    },
    {
      number: 2,
      topic: 'Дослідження методів програмної інженерії. (6/- год.)',
      goal: 'Дослідити особливості модульного та структурного програмування, навчитися створювати та використовувати власні бібліотеки функцій.',
      literature: '8',
    },
  ],

  cpit: [
    {
      title: 'Програмний продукт Sales 2.0.',
    },
    {
      title: 'Програмний продукт для компанії «Фармацевтика». ',
    },
  ],

  independent_work: [
    {
      topic:
        'Особливості індустрії ІТ в Україні та роль в ній програмної інженерії.',
      hours1: 2,
      hours2: 2,
    },
    {
      topic: 'Світові тенденції розвитку ПІ.',
      hours1: 1,
      hours2: 2,
    },
    {
      topic:
        'Особливості індустрії ІТ в Україні та роль в ній програмної інженерії.',
      hours1: 1,
      hours2: 4,
    },
    {
      topic:
        'Особливості індустрії ІТ в Україні та роль в ній програмної інженерії.',
      hours1: 2,
      hours2: 2,
    },
  ],

  // закінчив на 6 пункті
};

const handler = new TemplateHandler();
const doc = await handler.process(templateFile, data);

// 3. save output
fs.writeFileSync('myTemplate - output.docx', doc);
